Jchisholm204/Gentry/STM32_reference/embos/template_f4/BoardSupport/NXP/KE02Z_40_FRDM_KE02Z40M/DeviceSupport/drivers/fsl_clock.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @brief Enable the clock for specific IP.
 *
 * @param name  Which clock to enable, see \ref clock_ip_name_t.
 */
static inline void CLOCK_EnableClock(clock_ip_name_t name)
{
    uint32_t regAddr = SIM_BASE + CLK_GATE_ABSTRACT_REG_OFFSET((uint32_t)name);
    (*(volatile uint32_t *)regAddr) |= (1U << CLK_GATE_ABSTRACT_BITS_SHIFT((uint32_t)name));
}

/*!
 * @brief Disable the clock for specific IP.
 *
 * @param name  Which clock to disable, see \ref clock_ip_name_t.
 */
static inline void CLOCK_DisableClock(clock_ip_name_t name)
{
    uint32_t regAddr = SIM_BASE + CLK_GATE_ABSTRACT_REG_OFFSET((uint32_t)name);
    (*(volatile uint32_t *)regAddr) &= ~(1U << CLK_GATE_ABSTRACT_BITS_SHIFT((uint32_t)name));
}

/*!
 * @brief clock divider
 *
 * Set the SIM_BUSDIV.
 * Carefully configure the SIM_BUSDIV to avoid bus/flash clock frequency higher
 * than 24MHZ.
 * @param busDiv bus clock output divider value.
 */
static inline void CLOCK_SetBusClkDiv(uint32_t busDiv)
{
    SIM->BUSDIV = SIM_BUSDIV_BUSDIV(busDiv);
}

/*!
 * @brief Gets the clock frequency for a specific clock name.
 *
 * This function checks the current clock configurations and then calculates
 * the clock frequency for a specific clock name defined in clock_name_t.
 * The ICS must be properly configured before using this function.
 *
 * @param clockName Clock names defined in clock_name_t
 * @return Clock frequency value in Hertz
 */
uint32_t CLOCK_GetFreq(clock_name_t clockName);

/*!
 * @brief Get the core clock or system clock frequency.
 *
 * @return Clock frequency in Hz.
 */
uint32_t CLOCK_GetCoreSysClkFreq(void);

/*!
 * @brief Get the bus clock frequency.
 *
 * @return Clock frequency in Hz.
 */
uint32_t CLOCK_GetBusClkFreq(void);

/*!
 * @brief Get the flash clock frequency.
 *
 * @return Clock frequency in Hz.
 */
uint32_t CLOCK_GetFlashClkFreq(void);

/*!
 * @brief Get the OSC0 external reference clock frequency (OSC0ERCLK).
 *
 * @return Clock frequency in Hz.
 */
uint32_t CLOCK_GetOsc0ErClkFreq(void);

/*!
 * @brief Set the clock configure in SIM module.
 *
 * This function sets system layer clock settings in SIM module.
 *
 * @param config Pointer to the configure structure.
 */
void CLOCK_SetSimConfig(sim_clock_config_t const *config);

/*!
 * @brief Set the system clock dividers in SIM to safe value.
 *
 * The system level clocks (core clock, bus clock, and flash clock)
 * must be in allowed ranges. During ICS clock mode switch, the ICS output clock
 * changes then the system level clocks may be out of range. This function could
 * be used before ICS mode change, to make sure system level clocks are in allowed
 * range.
 *
 * @param config Pointer to the configure structure.
 */
static inline void CLOCK_SetSimSafeDivs(void)
{
    SIM->BUSDIV = 0x1U;
}

/*! @name ICS frequency functions. */
/*@{*/

/*!
 * @brief Gets the ICS output clock (ICSOUTCLK) frequency.
 *
 * This function gets the ICS output clock frequency in Hz based on the current ICS
 * register value.
 *
 * @return The frequency of ICSOUTCLK.
 */
uint32_t CLOCK_GetICSOutClkFreq(void);

/*!
 * @brief Gets the ICS FLL clock (ICSFLLCLK) frequency.
 *
 * This function gets the ICS FLL clock frequency in Hz based on the current ICS
 * register value. The FLL is enabled in FEI/FBI/FEE/FBE mode and
 * disabled in low power state in other modes.
 *
 * @return The frequency of ICSFLLCLK.
 */
uint32_t CLOCK_GetFllFreq(void);

/*!
 * @brief Gets the ICS internal reference clock (ICSIRCLK) frequency.
 *
 * This function gets the ICS internal reference clock frequency in Hz based
 * on the current ICS register value.
 *
 * @return The frequency of ICSIRCLK.
 */
uint32_t CLOCK_GetInternalRefClkFreq(void);

/*!
 * @brief Gets the ICS fixed frequency clock (ICSFFCLK) frequency.
 *
 * This function gets the ICS fixed frequency clock frequency in Hz based
 * on the current ICS register value.
 *
 * @return The frequency of ICSFFCLK.
 */
uint32_t CLOCK_GetICSFixedFreqClkFreq(void);

/*@}*/

/*! @name ICS clock configuration. */
/*@{*/

/*!
 * @brief Enables or disables the ICS low power.
 *
 * Enabling the ICS low power disables the PLL and FLL in bypass modes. In other words,
 * in FBE and PBE modes, enabling low power sets the ICS to BELP mode. In FBI and
 * PBI modes, enabling low power sets the ICS to BILP mode.
 * When disabling the ICS low power, the PLL or FLL are enabled based on ICS settings.
 *
 * @param enable True to enable ICS low power, false to disable ICS low power.
 */
static inline void CLOCK_SetLowPowerEnable(bool enable)
{
    if (enable)
    {
        ICS->C2 |= ICS_C2_LP_MASK;
    }
    else
    {
        ICS->C2 &= ~ICS_C2_LP_MASK;
    }
}

/*!
 * @brief Configures the Internal Reference clock (ICSIRCLK).
 *
 * This function sets the ICSIRCLK base on parameters.
 * This function also sets whether the \c ICSIRCLK is enabled in stop mode.
 *
 * @param enableMode ICSIRCLK enable mode, OR'ed value of @ref _ICS_irclk_enable_mode.
 * @retval kStatus_ICS_SourceUsed Because the internall reference clock is used as a clock source,
 * the confuration should not be changed. Otherwise, a glitch occurs.
 * @retval kStatus_Success ICSIRCLK configuration finished successfully.
 */
static inline void CLOCK_SetInternalRefClkConfig(uint8_t enableMode)
{
    /* Set internal reference clock selection. */
    ICS->C1 = (ICS->C1 & ~(ICS_C1_IRCLKEN_MASK | ICS_C1_IREFSTEN_MASK)) | (uint8_t)enableMode;
}

/*!
 * @brief Set the FLL external reference clock divider value.
 *
 * Sets the FLL external reference clock divider value, the register ICS_C1[RDIV].
 * Resulting frequency must be in the range 31.25KHZ to 39.0625KHZ.
 *
 * @param rdiv The FLL external reference clock divider value, ICS_C1[RDIV].
 */
static inline void CLOCK_SetFllExtRefDiv(uint8_t rdiv)
{
    ICS->C1 = (ICS->C1 & ~ICS_C1_RDIV_MASK) | ICS_C1_RDIV(rdiv);
}

/*@}*/

/*! @name ICS clock lock monitor functions. */
/*@{*/

/*!
 * @brief Sets the OSC0 clock monitor mode.
 *
 * This function sets the OSC0 clock monitor mode. See @ref ics_monitor_mode_t for details.
 *
 * @param enable, true to enable clock monitor, false to disable clock monitor.
 */
static inline void CLOCK_SetOsc0MonitorMode(bool enable)
{
    if (enable)
    {
        ICS->C4 |= ICS_C4_CME_MASK;
    }
    else
    {
        ICS->C4 &= ~ICS_C4_CME_MASK;
    }
}

/*@}*/

/*!
 * @name OSC configuration
 * @{
 */

/*!
 * @brief Initializes the OSC0.
 *
 * This function initializes the OSC0 according to the board configuration.
 *
 * @param  config Pointer to the OSC0 configuration structure.
 */
void CLOCK_InitOsc0(osc_config_t const *config);

/*!
 * @brief Deinitializes the OSC0.
 *
 * This function deinitializes the OSC0.
 */
void CLOCK_DeinitOsc0(void);

/* @} */

/*!
 * @name External clock frequency
 * @{
 */

/*!
 * @brief Sets the XTAL0 frequency based on board settings.
 *
 * @param freq The XTAL0/EXTAL0 input clock frequency in Hz.
 */
static inline void CLOCK_SetXtal0Freq(uint32_t freq)
{
    g_xtal0Freq = freq;
}

/*!
 * @brief Sets the OSC enable.
 *
 * @param enable osc enable mode.
 */
static inline void CLOCK_SetOsc0Enable(uint8_t enable)
{
    OSC0->CR |= (OSC0->CR & (~(OSC_CR_OSCSTEN_MASK | OSC_CR_OSCEN_MASK))) | enable;
}

/* @} */

/*! @name ICS mode functions. */
/*@{*/

/*!
 * @brief Gets the current ICS mode.
 *
 * This function checks the ICS registers and determines the current ICS mode.
 *
 * @return Current ICS mode or error code; See @ref ics_mode_t.
 */
ics_mode_t CLOCK_GetMode(void);

/*!
 * @brief Sets the ICS to FEI mode.
 *
 * This function sets the ICS to FEI mode. If setting to FEI mode fails
 * from the current mode, this function returns an error.
 *
 * @param       bDiv bus clock divider
 * @retval kStatus_ICS_ModeUnreachable Could not switch to the target mode.
 * @retval kStatus_Success Switched to the target mode successfully.
 */
status_t CLOCK_SetFeiMode(uint8_t bDiv);

/*!
 * @brief Sets the ICS to FEE mode.
 *
 * This function sets the ICS to FEE mode. If setting to FEE mode fails
 * from the current mode, this function returns an error.
 *
 * @param   bDiv bus clock divider
 * @param   rdiv  FLL reference clock divider setting, RDIV.
 *
 * @retval kStatus_ICS_ModeUnreachable Could not switch to the target mode.
 * @retval kStatus_Success Switched to the target mode successfully.
 */
status_t CLOCK_SetFeeMode(uint8_t bDiv, uint8_t rDiv);

/*!
 * @brief Sets the ICS to FBI mode.
 *
 * This function sets the ICS to FBI mode. If setting to FBI mode fails
 * from the current mode, this function returns an error.
 *
 * @param bDiv bus clock divider
 * @retval kStatus_ICS_ModeUnreachable Could not switch to the target mode.
 * @retval kStatus_Success Switched to the target mode successfully.s
 */
status_t CLOCK_SetFbiMode(uint8_t bDiv);

/*!
 * @brief Sets the ICS to FBE mode.
 *
 * This function sets the ICS to FBE mode. If setting to FBE mode fails
 * from the current mode, this function returns an error.
 *
 * @param   bDiv bus clock divider
 * @param   rdiv  FLL reference clock divider setting, RDIV.
 *
 * @retval kStatus_ICS_ModeUnreachable Could not switch to the target mode.
 * @retval kStatus_Success Switched to the target mode successfully.
 */
status_t CLOCK_SetFbeMode(uint8_t bDiv, uint8_t rDiv);

/*!
 * @brief Sets the ICS to BILP mode.
 *
 * This function sets the ICS to BILP mode. If setting to BILP mode fails
 * from the current mode, this function returns an error.
 *
 * @param   bDiv bus clock divider
 * @retval kStatus_ICS_ModeUnreachable Could not switch to the target mode.
 * @retval kStatus_Success Switched to the target mode successfully.
 */
status_t CLOCK_SetBilpMode(uint8_t bDiv);

/*!
 * @brief Sets the ICS to BELP mode.
 *
 * This function sets the ICS to BELP mode. If setting to BELP mode fails
 * from the current mode, this function returns an error.
 *
 * @param   bDiv bus clock divider
 * @retval kStatus_ICS_ModeUnreachable Could not switch to the target mode.
 * @retval kStatus_Success Switched to the target mode successfully.
 */
status_t CLOCK_SetBelpMode(uint8_t bDiv);

/*!
 * @brief Sets the ICS to FEI mode during system boot up.
 *
 * This function sets the ICS to FEI mode from the reset mode. It can also be used to
 * set up ICS during system boot up.
 *
 * @param  bDiv bus clock divider.
 *
 * @retval kStatus_ICS_ModeUnreachable Could not switch to the target mode.
 * @retval kStatus_Success Switched to the target mode successfully.
 */
status_t CLOCK_BootToFeiMode(uint8_t bDiv);

/*!
 * @brief Sets the ICS to FEE mode during system bootup.
 *
 * This function sets ICS to FEE mode from the reset mode. It can also be used to
 * set up the ICS during system boot up.
 *
 * @param   bDiv bus clock divider.
 * @param   rdiv  FLL reference clock divider setting, RDIV.
 *
 * @retval kStatus_ICS_ModeUnreachable Could not switch to the target mode.
 * @retval kStatus_Success Switched to the target mode successfully.
 */
status_t CLOCK_BootToFeeMode(uint8_t bDiv, uint8_t rDiv);

/*!
 * @brief Sets the ICS to BILP mode during system boot up.
 *
 * This function sets the ICS to BILP mode from the reset mode. It can also be used to
 * set up the ICS during sytem boot up.
 *
 * @param   bDiv bus clock divider.
 * @retval kStatus_ICS_SourceUsed Could not change ICSIRCLK setting.
 * @retval kStatus_Success Switched to the target mode successfully.
 */
status_t CLOCK_BootToBilpMode(uint8_t bDiv);

/*!
 * @brief Sets the ICS to BELP mode during sytem boot up.
 *
 * This function sets the ICS to BELP mode from the reset mode. It can also be used to
 * set up the ICS during sytem boot up.
 *
 * @param   bDiv bus clock divider.
 * @retval kStatus_ICS_ModeUnreachable Could not switch to the target mode.
 * @retval kStatus_Success Switched to the target mode successfully.
 */
status_t CLOCK_BootToBelpMode(uint8_t bDiv);

/*!
 * @brief Sets the ICS to a target mode.
 *
 * This function sets ICS to a target mode defined by the configuration
 * structure. If switching to the target mode fails, this function
 * chooses the correct path.
 *
 * @param  config Pointer to the target ICS mode configuration structure.
 * @return Return kStatus_Success if switched successfully; Otherwise, it returns an error code #_ICS_status.
 *
 * @note If the external clock is used in the target mode, ensure that it is
 * enabled. For example, if the OSC0 is used, set up OSC0 correctly before calling this
 * function.
 */
status_t CLOCK_SetIcsConfig(ics_config_t const *config);

/*@}*/

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* _FSL_CLOCK_H_ */
